#1. რეკურსიის დახმარებით შექმენი ფუნქცია, რომელიც იმდენჯერ დაბეჭდავს
# მისალმებას, რა რიცხვსაც გადასცემ არგუმენტად. (ციკლის გამოყენება არ შეიძლება)
def helloNtimes(n):
    if n==0:
        return
    else:
        print("Hello!")
        helloNtimes(n-1)

#2 შექმენი ფუნქცია, რომელიც მიიღებს შეკვეთას, ანუ კერძის სახელს და რაოდენობას და დაბეჭდავს მას,
# თუმცა რაოდენობას თუ არ მივუთითებთ შეცდომას არ ამოაგდებს და 1_ად ჩათვლის.

def order(meal, n=1):
    print(f"{n} porcia {meal}")
    return

#3 შექმენი ფუნქცია, რომელიც მიიღებს მინიმუმ 3 რიცხვს, და დააბრუნებს და დაბეჭდავს ნარმავლს.
def multiply(num1,num2,num3,*nums):
    p = num1*num2*num3
    for i in nums:
        p*=i 
    print(p)
    return p